InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатОтветственности</Name>
					<Comment>О материальной ответственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
			<Comment>Типы договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВиртуальныйДоговор</Name>
					<Comment>Виртуальный договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>Виды складов(Обычный, Ордерный, Ордерный и ячеистый)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
					<Comment>Обычный склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ордерный</Name>
					<Comment>Ордерный  склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ячеистый</Name>
					<Comment>Ордерный и ячеистый склад</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийныйРезерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хозяйстенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобильный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспедитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
					<Comment>Витрина</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратныйГарантийный</Name>
					<Comment>Для запчастей, снятых с автомобилей по гарантийным заказ-нарядам</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СМ_ПерепродажиЗапчастей/Ext/Module.bsl
Функция УниверсальнаяПерепродажаПоВсемСкладам(Ссылка_Товары,Ссылка_КодыМаркировки,Ссылка,ТекСкладКомпании) Экспорт 

	//Бондаренко++ 20220120
 	Отказ = Ложь;
	//Бондаренко-- 20220120
	
	СписокСкладов = Новый СписокЗначений;
	
	Для каждого Стр Из Ссылка_Товары Цикл 
		Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(Стр.СкладКомпании) Тогда
			    Продолжить;
			КонецЕсли;
			Если Стр.СкладКомпании.Организация = ТекСкладКомпании.Организация Тогда
				Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваровВПроизводство") И ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.РеализацияТоваров") Тогда
					Продолжить;			
 				КонецЕсли;
			КонецЕсли;
			Если Стр.СкладКомпании = ТекСкладКомпании Тогда
				Продолжить;			
 			КонецЕсли;
            //Бондаренко-- 20220120
  			Если СписокСкладов.НайтиПоЗначению(Стр.СкладКомпании) = Неопределено Тогда
				СписокСкладов.Добавить(Стр.СкладКомпании);					
			КонецЕсли;
		Иначе 
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(Стр.СкладыКомпании) Тогда
			    Продолжить;
			КонецЕсли;
			Если Стр.СкладыКомпании.Организация = ТекСкладКомпании.Организация Тогда
				Продолжить;			
 			КонецЕсли;
            //Бондаренко-- 20220120
 			Если СписокСкладов.НайтиПоЗначению(Стр.СкладыКомпании) = Неопределено Тогда
				СписокСкладов.Добавить(Стр.СкладыКомпании);					
			КонецЕсли;
		КонецЕсли;
 	КонецЦикла;
	
	//Бондаренко++ 20220120
	Если СписокСкладов.Количество() > 0 Тогда
	//Бондаренко-- 20220120	
 		Для каждого СкладОтправитель Из СписокСкладов Цикл
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(СкладОтправитель.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если СкладОтправитель.Значение.Организация = ТекСкладКомпании.Организация Тогда
				//Бондаренко++ 20220120
				Если СкладОтправитель.Значение <> ТекСкладКомпании Тогда
					Если ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваровВПроизводство") ИЛИ ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
						Отказ = СоздатьМежскладскоеПеремещение(Ссылка_Товары,Ссылка,СкладОтправитель.Значение,ТекСкладКомпании);
					КонецЕсли;	
 				КонецЕсли;
 				//Бондаренко++ 20220120
				Продолжить;			
			КонецЕсли;
			//Бондаренко-- 20220120
			Отказ = УниверсальнаяПерепродажа(Ссылка_Товары,Ссылка_КодыМаркировки,Ссылка,ТекСкладКомпании,СкладОтправитель.Значение);
			Если Отказ Тогда
				СМГ_Сообщить("Ошибка! Документы перепродажи не сформированы.",СтатусСообщения.ОченьВажное);
				СМГ_Сообщить("_____________________________________________",СтатусСообщения.ОченьВажное);	
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Отказ Тогда
			СМГ_Сообщить("Обработка по перепродаже завершена без ошибок.",СтатусСообщения.Обычное);	
			СМГ_Сообщить("=============================================",СтатусСообщения.Обычное);	
		КонецЕсли;
	//Бондаренко++ 20220120	
	Иначе
		СМГ_Сообщить("Список складов пустой. Нечего перепродавать.",СтатусСообщения.Обычное);	
  	КонецЕсли;                 	
    //Бондаренко-- 20220120
	
	Возврат Отказ;
	
КонецФункции // УнмверсальнаяПерепродажаПоВсемСкладам()

Функция УниверсальнаяПерепродажа(Ссылка_Товары,Ссылка_КодыМаркировки,Ссылка,ТекСкладКомпании,СкладОтправитель) Экспорт 
	
 	СтавкаНДС20 = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка", 20);
 	
	ЕстьОшибки=Ложь;
 	
 	РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияОбъект.РегламентированныйУчет = Истина;
	РеализацияОбъект.Дата = ТекущаяДата();
	РеализацияОбъект.УстановитьНовыйНомер();
	РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	
 	РеализацияОбъект.ДокументОснование=Ссылка;
	
	РеализацияОбъект.Организация = СкладОтправитель.Организация;
	РеализацияОбъект.ОбработкаРеквизита("Организация");
	
	РеализацияОбъект.ПодразделениеКомпании = СкладОтправитель.Подразделение;
 	
	РеализацияОбъект.СкладКомпании = СкладОтправитель;
	
	ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
	РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
 	
	Попытка
		РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
		РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить("ОШИБКА! Не найден тип цен 'Основной тип цен закупки'. Обработка прервана.", СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		ЕстьОшибки=Истина;
		Возврат ЕстьОшибки;
	КонецПопытки;	
  	
	РеализацияОбъект.КурсВалютыВзаиморасчетов=1;
	РеализацияОбъект.КурсВалютыУпр=1;
	РеализацияОбъект.КурсДокумента=1;
	
	РеализацияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
 	
	РеализацияОбъект.Контрагент = ТекСкладКомпании.Организация.КонтрагентОрганизации;
	РеализацияОбъект.ОбработкаРеквизита("Контрагент");
	
  	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",РеализацияОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
	ПараметрыДоговора.Вставить("Организация",РеализацияОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",РеализацияОбъект.ПодразделениеКомпании);
	ПараметрыДоговора.Вставить("ТипДоговора",Перечисления.ТипыДоговоров.Договор); 
  	
	РеализацияОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
  	РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
	РеализацияОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
	
	//Бондаренко++ 20241225
	//Если РеализацияОбъект.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная Тогда
	//	ТекСтавкаНДС=Справочники.СтавкиНДС.БезНДС;
	//Иначе	
	//	ТекСтавкаНДС=СтавкаНДС20;
	//КонецЕсли;
 	ТекСтавкаНДС = СМГ_ПолучитьСтавкуНДС(РеализацияОбъект.Организация,РеализацияОбъект.Дата);
 	//Бондаренко-- 20241225
	
	Для Каждого стр из Ссылка_Товары Цикл 
		
		Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Если стр.СкладКомпании <> СкладОтправитель Тогда
				Продолжить;
	 		КонецЕсли;
		Иначе	
			Если стр.СкладыКомпании <> СкладОтправитель Тогда
				Продолжить;
	 		КонецЕсли;
 		КонецЕсли;
 		
		СтрокаРеализации = РеализацияОбъект.Товары.Добавить();
		СтрокаРеализации.Номенклатура = стр.Номенклатура;
		Попытка
			СтрокаРеализации.ИдентификаторТовара = стр.ИдентификаторТовара;
 		Исключение
	 	КонецПопытки;
  		
   		СтрокаРеализации.Цена = обПолучитьЦену(РеализацияОбъект.ТипЦен,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения , РеализацияОбъект.ПодразделениеКомпании);
 		 
		СтрокаРеализации.Количество = стр.Количество;
		СтрокаРеализации.ЕдиницаИзмерения = стр.ЕдиницаИзмерения;
  	   
	    СтрокаРеализации.СтавкаНДС = ТекСтавкаНДС;
 
	    ДопПараметры = Новый Структура;
	    
	    ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
	    ДопПараметры.Вставить("ПересчитатьЦену",Истина);
	    РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
	  
	    РеализацияОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаРеализации,, ДопПараметры);
	    РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаРеализации,, ДопПараметры);
	    РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаРеализации,, ДопПараметры);
	    РеализацияОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаРеализации,, ДопПараметры);
		
  		СтрокаРеализации.СтавкаНДС = ТекСтавкаНДС;
		
	    РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаРеализации,, ДопПараметры);
 		
 		СтрокаРеализации.СуммаВсего=СтрокаРеализации.Сумма;
  		РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаРеализации,, ДопПараметры);
		
	КонецЦикла;
	
 	Если Ссылка_КодыМаркировки.Количество() > 0 Тогда
 		//РеализацияОбъект.КодыМаркировки.Загрузить(ТабКодов);			
		Для каждого ТекКод Из Ссылка_КодыМаркировки Цикл          
			ПарОтбора = Новый Структура();
			ПарОтбора.Вставить("ИдентификаторТовара",ТекКод.ИдентификаторТовара);
			НайденныеСтроки = РеализацияОбъект.Товары.НайтиСтроки(ПарОтбора);
		    Если НайденныеСтроки.Количество() > 0  Тогда
				НоваяСтрокаКодовМаркировки = РеализацияОбъект.КодыМаркировки.Добавить();			
				НоваяСтрокаКодовМаркировки.ИдентификаторТовара = ТекКод.ИдентификаторТовара;
				НоваяСтрокаКодовМаркировки.КодМаркировки = ТекКод.КодМаркировки;
 			КонецЕсли;
 		КонецЦикла;
 	КонецЕсли; 
 	
	РеализацияОбъект.ПересчитатьПоСебестоимости(""); 
	
 	Для каждого СтрокаРеализации Из РеализацияОбъект.Товары Цикл
		Если СтрокаРеализации.Цена = 0 Тогда
			СтрокаРеализации.Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенЗакупки,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения , Справочники.ПодразделенияКомпании.ОсновноеПодразделение );
			Если СтрокаРеализации.Цена = 0 Тогда
				СтрокаРеализации.Цена = обПолучитьЦену(Справочники.ТипыЦен.ОсновнойТипЦенЗакупки,СтрокаРеализации.Номенклатура,РеализацияОбъект.Дата,,РеализацияОбъект.ВалютаДокумента,РеализацияОбъект.КурсДокумента, ,СтрокаРеализации.ЕдиницаИзмерения, РеализацияОбъект.ПодразделениеКомпании);			   
			КонецЕсли;		
			Если СтрокаРеализации.Цена = 0 Тогда
				СтрокаРеализации.Цена = 1;			   
			КонецЕсли;
			СтрокаРеализации.Сумма = СтрокаРеализации.Цена*СтрокаРеализации.Количество*СтрокаРеализации.Коэффициент;
			СтрокаРеализации.СуммаВсего = СтрокаРеализации.Сумма;
			СтрокаРеализации.СуммаНДС = СтрокаРеализации.СуммаВсего*СтрокаРеализации.СтавкаНДС.Ставка/(100+СтрокаРеализации.СтавкаНДС.Ставка);				
		КонецЕсли;
	КонецЦикла;
 	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			СМГ_Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат ЕстьОшибки;
	КонецЕсли;
	
 	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Попытка
		СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
 	Конецпопытки;	
 	
	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;	
	
	ТЗ_Себест = РеализацияОбъект.Движения.ПартииТоваровКомпании.Выгрузить();
 	ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр,Количество");  
	
	ТЗ_Себест.Очистить();
	
	БылПовторныйПересчет=Ложь;
	
	Для Каждого СтрокаТовары Из РеализацияОбъект.Товары Цикл
		
		СуммаСписания = дкПолучитьСуммуСписания(РеализацияОбъект, "ПартииТоваровКомпании", , СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
		
		НовСтр = ТЗ_Себест.Добавить();
		НовСтр.Номенклатура = СтрокаТовары.Номенклатура;
		НовСтр.Количество = СтрокаТовары.Количество * СтрокаТовары.Коэффициент;
		НовСтр.СуммаУпр = СуммаСписания;
		
 		Если СтрокаТовары.Количество > 0 Тогда
 			Если РеализацияОбъект.Организация.ИНН = "616714023180" Тогда
				Если СуммаСписания > 1.00 Тогда
					СтрокаТовары.Цена  =  СуммаСписания / СтрокаТовары.Количество;
					СтрокаТовары.СуммаВсего = СтрокаТовары.Цена*СтрокаТовары.КоличествоБазовое;
					СтрокаТовары.Сумма=СтрокаТовары.Цена*СтрокаТовары.КоличествоБазовое;
					РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТовары,, ДопПараметры);
					БылПовторныйПересчет=Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
 	КонецЦикла;
	
 	Если БылПовторныйПересчет Тогда
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
				СМГ_Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
	КонецЕсли; 
 	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			СМГ_Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
 	Попытка
		СвойствоАвто = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
 	Конецпопытки;	
 	
	СМГ_Сообщить("Сформирован документ: "+РеализацияОбъект,СтатусСообщения.Информация);
	
	ТабДок  = Новый ТабличныйДокумент;
 	РеализацияОбъект.ПечатьУПД(ТабДок);
 	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр=Истина;
	Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТабДок.Показать();                                             
	КонецЕсли;	
	
	//Бондаренко++ 20220610
	//ФормироватьСФ = Истина;
	
	//Если ФормироватьСФ Тогда
	//
	//   СчетФактураОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
	//   СчетФактураОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
	//   
	//   ЕстьОшибки=Ложь;
	//   
	//   Попытка
	//   	СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//   Исключение
	//   	Попытка
	//   		СчетФактураОбъект.УстановитьНовыйНомер();
	//   		СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//   	Исключение
	//   		СМГ_Сообщить(ОписаниеОшибки());
	//   		ЕстьОшибки=Истина;
	//   	КонецПопытки;	
	//   КонецПопытки;	
	//   
	//   Если ЕстьОшибки Тогда
	//   	СМГ_Сообщить("ОШИБКА! СчетФактура выданный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
	//   	Возврат ЕстьОшибки;
	//   КонецЕсли; 
	//   
	//   СМГ_Сообщить("Сформирован документ: "+СчетФактураОбъект,СтатусСообщения.Информация);
	//   
	//   ТабДок = Новый ТабличныйДокумент;
	//   
	//   СчетФактураОбъект.ПечатьСчетФактура(ТабДок);
	//   ТабДок.АвтоМасштаб=Истина;
	//   ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	//   ТабДок.ТолькоПросмотр=Истина;
	//   Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
	//   	ТабДок.Показать();
	//   КонецЕсли;
	//
	//КонецЕсли; 
	//Бондаренко-- 20220610
	
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	ПоступлениеОбъект.ПроводитьПриНаличииОшибок=Истина;
 	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ТекущаяДата();
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	ПоступлениеОбъект.ДокументОснование = РеализацияОбъект.Ссылка;
	
	ПоступлениеОбъект.Организация = ТекСкладКомпании.Организация;
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	
	ПоступлениеОбъект.ВхДокДата = РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	ПоступлениеОбъект.ПодразделениеКомпании = ТекСкладКомпании.Подразделение;
	ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПоступлениеОбъект.СкладКомпании = ТекСкладКомпании;
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПоступлениеОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.КурсДокумента = 1;
	ПоступлениеОбъект.КурсВалютыВзаиморасчетов = 1;
	ПоступлениеОбъект.КурсВалютыУпр = 1;
	
	ПоступлениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	ПоступлениеОбъект.Контрагент = СкладОтправитель.Организация.КонтрагентОрганизации;
	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",ПоступлениеОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
	ПараметрыДоговора.Вставить("Организация",ПоступлениеОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",ПоступлениеОбъект.ПодразделениеКомпании);
	ПараметрыДоговора.Вставить("ТипДоговора",Перечисления.ТипыДоговоров.Договор);
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = НайтиДоговор(ПараметрыДоговора);
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	ПоступлениеОбъект.ВхДокДата  =РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан автоматически "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями";
	
	ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
 	
	ПоступлениеОбъект.Товары.Загрузить(ВремТЗ);
	
	Если Ссылка_КодыМаркировки.Количество() > 0 Тогда  
		//++Галактионов ЧестныйЗнак
		ПоступлениеОбъект.КодыМаркировки.Загрузить(Ссылка_КодыМаркировки.Выгрузить());
		//--Галактионов ЧестныйЗнак
	КонецЕсли; 
 	
	ЕстьОшибки=Ложь;
	
	Попытка
		ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СМГ_Сообщить(ОписаниеОшибки());
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		СМГ_Сообщить("ОШИБКА! Поступление товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		Возврат ЕстьОшибки;
	КонецЕсли; 
	
	СМГ_Сообщить("Сформирован документ: "+ПоступлениеОбъект,СтатусСообщения.Информация);
 	
	// Если НЕ ФормироватьСФ Тогда
	//	Возврат ЕстьОшибки;
	// КонецЕсли;	
	//
	//  Если ФормироватьСФ Тогда
	//	
	//	СчетФактураПолученныйОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
	//	СчетФактураПолученныйОбъект.ОбработкаЗаполнения(ПоступлениеОбъект.Ссылка);
	//	
	//	ЕстьОшибки=Ложь;
	//	Попытка
	//		СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	Исключение
	//		СМГ_Сообщить(ОписаниеОшибки());
	//		ЕстьОшибки=Истина;
	//	КонецПопытки;	
	//	
	//	Если ЕстьОшибки Тогда
	//		СМГ_Сообщить("ОШИБКА! СчетФактура полученный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
	//		Возврат ЕстьОшибки;
	//	КонецЕсли; 
	//	
	//	СМГ_Сообщить("Сформирован документ: "+СчетФактураПолученныйОбъект,СтатусСообщения.Информация);
	//	
	//КонецЕсли; 
	
	//Бондаренко++ 20220121
	Попытка
		Если ((ТипЗНЧ(Ссылка)=Тип("ДокументСсылка.ПеремещениеТоваров")) И (Ссылка.СформированАвтоматически) И (РеализацияОбъект.ПодразделениеКомпании.Родитель<>Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000117"))) ИЛИ
			 ((ТипЗНЧ(Ссылка)=Тип("ДокументСсылка.РеализацияТоваров")) И (РеализацияОбъект.СкладКомпании.Подразделение.Родитель<>Ссылка.СкладКомпании.Подразделение.Родитель)) Тогда
			Попытка
				РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				СМГ_Сообщить(""+РеализацияОбъект+" - снят с проведения.");			
			Исключение
				СМГ_Сообщить("ОШИБКА! "+РеализацияОбъект+" не удалось снять с проведения.",СтатусСообщения.ОченьВажное);			
			КонецПопытки;
			//Бондаренко++ 20220318
			//Попытка
			//	СчетФактураОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	СМГ_Сообщить(""+СчетФактураОбъект+" - снят с проведения");			
			//Исключение
			//	СМГ_Сообщить("ОШИБКА! "+СчетФактураОбъект+" не удалось снять с проведения.",СтатусСообщения.ОченьВажное);			
			//КонецПопытки;        
			//Бондаренко-- 20220318
			Попытка
				ПоступлениеОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				СМГ_Сообщить(""+ПоступлениеОбъект+" - снят с проведения.");			
			Исключение
				СМГ_Сообщить("ОШИБКА! "+ПоступлениеОбъект+" не удалось снять с проведения.",СтатусСообщения.ОченьВажное);			
			КонецПопытки; 
			//Бондаренко++ 20220318
			//Попытка
			//	СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	СМГ_Сообщить(""+СчетФактураПолученныйОбъект+" - снят с проведения");			
			//Исключение
			//	СМГ_Сообщить("ОШИБКА! "+СчетФактураПолученныйОбъект+" не удалось снять с проведения.",СтатусСообщения.ОченьВажное);			
			//КонецПопытки;
			//Бондаренко-- 20220318
		КонецЕсли;
	Исключение
	КонецПопытки;
  	//Бондаренко-- 20220121
	
	Возврат ЕстьОшибки;
	
КонецФункции

Функция НайтиДоговор(ПараметрыДоговора)
	
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыВзаиморасчетов.Ссылка,
	|	ДоговорыВзаиморасчетов.ВидДоговора,
	|	ДоговорыВзаиморасчетов.Владелец,
	|	ДоговорыВзаиморасчетов.Организация,
	|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления,
	|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
	|	ДоговорыВзаиморасчетов.ДляПерепродаж,
	|	ДоговорыВзаиморасчетов.ДляЗапчастей
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
	|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
	|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
	//Бондаренко++ 20220527
	|	И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
	|			ИЛИ ДоговорыВзаиморасчетов.ДатаКонца > &ТекущаяДата)
	//Бондаренко-- 20220527
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
  
	Запрос.УстановитьПараметр("ВыбВидДоговора", ПараметрыДоговора.ВидДоговора);
	Запрос.УстановитьПараметр("ВыбВладелец", ПараметрыДоговора.Контрагент);
	Запрос.УстановитьПараметр("ВыбОрганизация", ПараметрыДоговора.Организация);
	//Бондаренко++ 20220527
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());	
	//Бондаренко-- 20220527
 
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорВзаиморасчетов = ВыборкаДетальныеЗаписи.Ссылка; 
		Если ВыборкаДетальныеЗаписи.ДляПерепродаж Тогда
			Прервать;
 		КонецЕсли; 
 	КонецЦикла;
	
	Если обЗначениеНезаполнено(ДоговорВзаиморасчетов) Тогда
		Дог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		Дог.Автор=ПараметрыСеанса.Пользователь;
		Дог.ДатаСоздания=ТекущаяДата();
		Дог.ДатаНачала=ТекущаяДата();
		Дог.ВидДоговора=ПараметрыДоговора.ВидДоговора;
		Дог.ТипДоговора=ПараметрыДоговора.ТипДоговора;
		Дог.Владелец = ПараметрыДоговора.Контрагент;
		Дог.Организация = ПараметрыДоговора.Организация;
		Дог.Подразделение = ПараметрыДоговора.Подразделение;
		Дог.ВалютаВзаиморасчетов=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Дог.ВидОплаты=Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		Дог.ДляЗапчастей=Истина;
		Дог.ДляАвтосервиса=Истина;
		Дог.ДляПерепродаж=Истина;
 		Дог.Наименование = СокрЛП(Строка(Дог.ВидДоговора))
	             + ?(ПустаяСтрока(Дог.НомерДоговора),""," № " + СокрЛП(Дог.НомерДоговора))
	             + " в " + Дог.ВалютаВзаиморасчетов.Наименование
	             + " от "+Формат(Дог.ДатаНачала,"ДФ=дд.ММ.гг");
				 
		Дог.УстановитьНовыйКод();		 
 		
		Попытка
 			Дог.Записать();
			ДоговорВзаиморасчетов = Дог.Ссылка;
		Исключение
		 	СМГ_Сообщить("ОШИБКА! Не удалось создать договор.",СтатусСообщения.ОченьВажное);		
  		КонецПопытки;
 	
	КонецЕсли; 
	
	Возврат ДоговорВзаиморасчетов;
 
КонецФункции // НайтиДоговор(ПараметрыДоговора)

Функция СоздатьМежскладскоеПеремещение(ТоварыКПродаже,Ссылка,СкладОтправитель,СкладПолучатель) Экспорт
	
	СтавкаНДС20  = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка", 20);
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;
	
	ЕстьОшибки = Ложь;
	
	ПеремещениеОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ПеремещениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПеремещениеОбъект.ДокументОснование=Ссылка;
	
	ПеремещениеОбъект.Организация = СкладПолучатель.Организация;
	ПеремещениеОбъект.ОбработкаРеквизита("Организация");
	
	ПеремещениеОбъект.ПодразделениеКомпании = СкладПолучатель.Подразделение;
	ПеремещениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПеремещениеОбъект.РегламентированныйУчет = Истина;
	ПеремещениеОбъект.Дата = ТекущаяДата();
	ПеремещениеОбъект.УстановитьНовыйНомер();
	ПеремещениеОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров;
	
	ПеремещениеОбъект.СкладКомпании = СкладОтправитель;
	ПеремещениеОбъект.СкладПолучатель = СкладПолучатель;
	
	ПеремещениеОбъект.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	ПеремещениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПеремещениеОбъект.КурсДокумента = 1;
	ПеремещениеОбъект.КурсВалютыУпр = 1;
	ПеремещениеОбъект.ЗакрытиеЗаказовПоПодразделению=Истина;
	ПеремещениеОбъект.СверкаПроведена=Истина;
	
	ПеремещениеОбъект.ДатаСоздания = ТекущаяДата();
	
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	ПеремещениеОбъект.ОтпустилСот = ТекущийСотрудник;
	ПеремещениеОбъект.ПолучилСот = ТекущийСотрудник;
	ПеремещениеОбъект.Перевозчик = ТекущийСотрудник;
	
	ПеремещениеОбъект.ВизаОтправил = Истина;
	ПеремещениеОбъект.ВизаПолучил = Истина;
	
	ПеремещениеОбъект.СформированАвтоматически=Ложь;
	ПеремещениеОбъект.Комментарий = "Создан - "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перемещения запасных частей между складами.";
	
	//Бондаренко++ 20220214	
	ТоварыКПродаже_ = Новый ТаблицаЗначений();
 	ТоварыКПродаже_ = ТоварыКПродаже.Выгрузить();
	ТоварыКПродаже_.Свернуть("Номенклатура,ЕдиницаИзмерения,Коэффициент,СкладКомпании,ХарактеристикаНоменклатуры,Партия,ГТД","Количество");
	
	//Для каждого Стр Из ТоварыКПродаже Цикл
	Для каждого Стр Из ТоварыКПродаже_ Цикл	
	//Бондаренко-- 20220214	
		
 		Если Стр.СкладКомпании <> СкладОтправитель Тогда
			Продолжить;		
		КонецЕсли;

		СтрокаТовары = ПеремещениеОбъект.Товары.Добавить();		
		
 		СтрокаТовары.Номенклатура = Стр.Номенклатура;
 		 
		СтрокаТовары.Количество = Стр.Количество;
		СтрокаТовары.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
		СтрокаТовары.Коэффициент = Стр.ЕдиницаИзмерения.Коэффициент;
		СтрокаТовары.Цена = обПолучитьЦену(ПеремещениеОбъект.ТипЦен,СтрокаТовары.Номенклатура,ПеремещениеОбъект.Дата,,ПеремещениеОбъект.ВалютаДокумента,ПеремещениеОбъект.КурсДокумента, ,СтрокаТовары.ЕдиницаИзмерения , ПеремещениеОбъект.ПодразделениеКомпании);
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("НеПерерасчитыватьЦену",Ложь);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаТовары,, ДопПараметры);
		
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаТовары,, ДопПараметры);
		
		//Бондаренко++ 20241225
		//Если ПеремещениеОбъект.Организация.ОсвобожденОтНДС Тогда
		// СтрокаТовары.СтавкаНДС = СтавкаБезНДС;
		//Иначе	
		// СтрокаТовары.СтавкаНДС=СтавкаНДС20;	
		//КонецЕсли;
		СтрокаТовары.СтавкаНДС = СМГ_ПолучитьСтавкуНДС(ПеремещениеОбъект.Организация,ПеремещениеОбъект.Дата);
		//Бондаренко-- 20241225
		
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаТовары,, ДопПараметры);
		СтрокаТовары.СуммаВсего=СтрокаТовары.Сумма;
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТовары,, ДопПараметры);
	КонецЦикла; 
 	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
 		СМГ_Сообщить("ОШИБКА! Перемещение между складами не сформировано.",СтатусСообщения.ОченьВажное);
	Иначе		
 		СМГ_Сообщить("Сформирован документ: "+ПеремещениеОбъект,СтатусСообщения.Информация);	 
	КонецЕсли;	
 	
	Попытка
		СвойствоАвто = РегиСтрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = ПеремещениеОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;	
 	
	Возврат ЕстьОшибки;
	
КонецФункции // СоздатьМежскладскоеПеремещение(ТоварыКПродаже,Ссылка,СкладОтправитель,СкладПолучатель)

 //Бондаренко++ 20220318
Функция СоздатьМежскладскоеПеремещениеОбщийМодуль(ТоварыКПродаже,Ссылка,СкладОтправитель,СкладПолучатель) Экспорт
	
	СтавкаНДС20  = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка", 20);
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;
	
	ЕстьОшибки = Ложь;
	
	ПеремещениеОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ПеремещениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПеремещениеОбъект.ДокументОснование=Ссылка;
	
	ПеремещениеОбъект.Организация = СкладПолучатель.Организация;
	ПеремещениеОбъект.ОбработкаРеквизита("Организация");
	
	ПеремещениеОбъект.ПодразделениеКомпании = СкладПолучатель.Подразделение;
	ПеремещениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПеремещениеОбъект.РегламентированныйУчет = Истина;
	ПеремещениеОбъект.Дата = ТекущаяДата();
	ПеремещениеОбъект.УстановитьНовыйНомер();
	ПеремещениеОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров;
	
	ПеремещениеОбъект.СкладКомпании = СкладОтправитель;
	ПеремещениеОбъект.СкладПолучатель = СкладПолучатель;
	
	ПеремещениеОбъект.ТипЦен=Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	ПеремещениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПеремещениеОбъект.КурсДокумента = 1;
	ПеремещениеОбъект.КурсВалютыУпр = 1;
	ПеремещениеОбъект.ЗакрытиеЗаказовПоПодразделению=Истина;
	ПеремещениеОбъект.СверкаПроведена=Истина;
	
	ПеремещениеОбъект.ДатаСоздания = ТекущаяДата();
	
	ТекущийСотрудник = ПараметрыСеанса.Пользователь.Сотрудник;
	ПеремещениеОбъект.ОтпустилСот = ТекущийСотрудник;
	ПеремещениеОбъект.ПолучилСот = ТекущийСотрудник;
	ПеремещениеОбъект.Перевозчик = ТекущийСотрудник;
	
	ПеремещениеОбъект.ВизаОтправил = Истина;
	ПеремещениеОбъект.ВизаПолучил = Истина;
	
	ПеремещениеОбъект.СформированАвтоматически=Ложь;
	ПеремещениеОбъект.Комментарий = "Создан: "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь+" для перемещения запасных частей между складами.";
	
	Для каждого Стр Из ТоварыКПродаже Цикл
		
		СтрокаТовары = ПеремещениеОбъект.Товары.Добавить();
		СтрокаТовары.Номенклатура = Стр.Товар;
		СтрокаТовары.Количество = Стр.Количество;
		СтрокаТовары.ЕдиницаИзмерения = Стр.ЕдиницаИзмерения;
		СтрокаТовары.Коэффициент = Стр.ЕдиницаИзмерения.Коэффициент;
		СтрокаТовары.Цена = обПолучитьЦену(ПеремещениеОбъект.ТипЦен,СтрокаТовары.Номенклатура,ПеремещениеОбъект.Дата,,ПеремещениеОбъект.ВалютаДокумента,ПеремещениеОбъект.КурсДокумента, ,СтрокаТовары.ЕдиницаИзмерения , ПеремещениеОбъект.ПодразделениеКомпании);
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("НеПерерасчитыватьЦену",Ложь);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаТовары,, ДопПараметры);
		
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаТовары,, ДопПараметры);
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.Коэффициент", СтрокаТовары,, ДопПараметры);
		
		//Бондаренко++ 20241225
		//Если ПеремещениеОбъект.Организация.ОсвобожденОтНДС Тогда
		//	СтрокаТовары.СтавкаНДС = СтавкаБезНДС;
		//Иначе	
		//СтрокаТовары.СтавкаНДС=СтавкаНДС20;	
		//КонецЕсли;
 		СтрокаТовары.СтавкаНДС = СМГ_ПолучитьСтавкуНДС(ПеремещениеОбъект.Организация,ПеремещениеОбъект.Дата);
 		//Бондаренко-- 20241225
		
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаТовары,, ДопПараметры);
		СтрокаТовары.СуммаВсего=СтрокаТовары.Сумма;
		ПеремещениеОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТовары,, ДопПараметры);
	КонецЦикла; 
 	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
 		СМГ_Сообщить("ОШИБКА! Перемещение между складами не сформировано.",СтатусСообщения.ОченьВажное);
	Иначе		
 		СМГ_Сообщить("Сформирован документ: "+ПеремещениеОбъект,СтатусСообщения.Информация);	 
	КонецЕсли;	
 	
	Попытка
		СвойствоАвто = РегиСтрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = ПеремещениеОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;	
 	
	Возврат ЕстьОшибки;
	
КонецФункции // СоздатьМежскладскоеПеремещениеОбщийМодуль(ТоварыКПродаже,Ссылка,СкладОтправитель,СкладПолучатель)

Функция НайтиДоговорОбщийМодуль(ПараметрыДоговора) Экспорт
	
	ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыВзаиморасчетов.Ссылка,
	|	ДоговорыВзаиморасчетов.ВидДоговора,
	|	ДоговорыВзаиморасчетов.Владелец,
	|	ДоговорыВзаиморасчетов.Организация,
	|	ДоговорыВзаиморасчетов.ДатаСоздания КАК ДатаСоздания,
	|	ДоговорыВзаиморасчетов.ПометкаУдаления,
	|	ДоговорыВзаиморасчетов.Владелец.ОсновнойДоговорВзаиморасчетов КАК ОснДоговор,
	|	ДоговорыВзаиморасчетов.ДляПерепродаж,
	|	ДоговорыВзаиморасчетов.ДляЗапчастей
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &ВыбВладелец
	|	И ДоговорыВзаиморасчетов.Организация = &ВыбОрганизация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВыбВидДоговора
	|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыВзаиморасчетов.ДляЗапчастей = ИСТИНА
	|	И ДоговорыВзаиморасчетов.ДляПерепродаж = ИСТИНА
	//Бондаренко++ 20220527
	|	И (ДоговорыВзаиморасчетов.ДатаКонца = &ПустаяДата
	|			ИЛИ ДоговорыВзаиморасчетов.ДатаКонца > &ТекущаяДата)
	//Бондаренко-- 20220527
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	
	Запрос.УстановитьПараметр("ВыбВидДоговора", ПараметрыДоговора.ВидДоговора);
	Запрос.УстановитьПараметр("ВыбВладелец", ПараметрыДоговора.Контрагент);
	Запрос.УстановитьПараметр("ВыбОрганизация", ПараметрыДоговора.Организация);
	
	//Бондаренко++ 20220527
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());	
	//Бондаренко-- 20220527
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДоговорВзаиморасчетов = ВыборкаДетальныеЗаписи.Ссылка; 
		Если ВыборкаДетальныеЗаписи.ДляПерепродаж Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если обЗначениеНезаполнено(ДоговорВзаиморасчетов) Тогда
		Дог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		Дог.Автор=ПараметрыСеанса.Пользователь;
		Дог.ДатаСоздания=ТекущаяДата();
		Дог.ДатаНачала=ТекущаяДата();
		Дог.ВидДоговора=ПараметрыДоговора.ВидДоговора;
		Дог.Владелец = ПараметрыДоговора.Контрагент;
		Дог.Организация = ПараметрыДоговора.Организация;
		Дог.Подразделение = ПараметрыДоговора.Подразделение;
		Дог.ВалютаВзаиморасчетов=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		Дог.ВидОплаты=Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		Дог.ДляЗапчастей=Истина;
		Дог.ДляПерепродаж=Истина;
		Дог.Наименование = СокрЛП(Строка(Дог.ВидДоговора))
		+ ?(ПустаяСтрока(Дог.НомерДоговора),""," № " + СокрЛП(Дог.НомерДоговора))
		+ " в " + Дог.ВалютаВзаиморасчетов.Наименование
		+ " от "+Формат(Дог.ДатаНачала,"ДФ=дд.ММ.гг");
		Дог.УстановитьНовыйКод();
		
		Попытка
			Дог.Записать();
			ДоговорВзаиморасчетов = Дог.Ссылка;
		Исключение
			СМГ_Сообщить("ОШИБКА! Не удалось записать договор");		
		КонецПопытки;
		
	КонецЕсли; 
	
	Возврат ДоговорВзаиморасчетов;
	
	
КонецФункции // НайтиДоговорОбщийМодуль(ПараметрыДоговора)

Функция СоздатьДокументыПерепродажиПоЮрЛицамОбщийМодуль(ТоварыКПродаже,ДокументОснование,СкладОтправитель, СкладПолучатель) Экспорт 
	
 	ЕстьОшибки=Ложь;
	
	РеализацияОбъект = Документы.РеализацияТоваров.СоздатьДокумент();
	РеализацияОбъект.РегламентированныйУчет = Истина;
	РеализацияОбъект.Дата = ТекущаяДата();
	 
	РеализацияОбъект.ХозОперация = Справочники.ХозОперации.РеализацияТоваров;
	
	РеализацияОбъект.ДокументОснование=ДокументОснование;
	
	РеализацияОбъект.Организация = СкладОтправитель.Организация;
	РеализацияОбъект.ОбработкаРеквизита("Организация");
	
	РеализацияОбъект.ПодразделениеКомпании = СкладОтправитель.Подразделение;
	//РеализацияОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
		
	РеализацияОбъект.СкладКомпании = СкладОтправитель;
	
	РеализацияОбъект.УстановитьНовыйНомер();
	
	РеализацияОбъект.ИсточникИнформации=Справочники.ИсточникиИнформации.ЛичныйВизит;
 	
	ДопПараметры = Новый Структура("НеРассчитыватьСкидки,ВозможностьИзмененияЦен",Истина,Ложь);
	РеализацияОбъект.ОбработкаРеквизита("СкладКомпании",,,ДопПараметры);
	
	РеализацияОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	РеализацияОбъект.ОбработкаРеквизита("ТипЦен");
	
	РеализацияОбъект.КурсВалютыВзаиморасчетов=1;
	РеализацияОбъект.КурсВалютыУпр=1;
	РеализацияОбъект.КурсДокумента=1;
	
	РеализацияОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	РеализацияОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	РеализацияОбъект.Контрагент = СкладПолучатель.Организация.КонтрагентОрганизации;
	//Бондаренко++ 20210415
	//Если РеализацияОбъект.Контрагент.Родитель = Справочники.Контрагенты.ДопОборудование Тогда
	//	РеализацияОбъект.Контрагент = Справочники.Контрагенты.ОсновнойПокупатель;	
	//КонецЕсли; 
	//Бондаренко-- 20210415
 	РеализацияОбъект.ОбработкаРеквизита("Контрагент");
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",РеализацияОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Продажа);
	ПараметрыДоговора.Вставить("Организация",РеализацияОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",РеализацияОбъект.ПодразделениеКомпании);
	РеализацияОбъект.ДоговорВзаиморасчетов = НайтиДоговорОбщийМодуль(ПараметрыДоговора);
	РеализацияОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");	
	
	РеализацияОбъект.Автор = ПараметрыСеанса.Пользователь;
	РеализацияОбъект.Комментарий = "Создан: "+ТекущаяДата()+" пользователем: "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями.";
	
	РеализацияОбъект.Товары.Загрузить(ТоварыКПродаже);
	
	Для Каждого СтрокаРеализации из РеализацияОбъект.Товары Цикл 
		
		ДопПараметры = Новый Структура;
		
		ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
		ДопПараметры.Вставить("НеПерерасчитыватьЦену",Ложь);
		
		РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Организация", СтрокаРеализации,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаРеализации,, ДопПараметры);

	КонецЦикла;	
	
	//РеализацияОбъект.ПересчитатьПоСебестоимости("");
	//РеализацияОбъект.ОбработкаРеквизита("Организация");
 	
  	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			СМГ_Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
 	КонецЕсли;
	
 	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Попытка
		СвойствоАвто = РегиСтрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
 	
	Попытка
		РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		#Если НаКлиенте Тогда
			СМГ_Сообщить(ОписаниеОшибки());
		#КонецЕсли
		ЕстьОшибки=Истина;
	КонецПопытки;	
	
	//ТЗ_Себест = РеализацияОбъект.Движения.ПартииТоваровКомпании.Выгрузить();
	//  ТЗ_Себест.Свернуть("Номенклатура","СуммаУпр,Количество");  
	// ТЗ_Себест.Очистить();
	
	БылПовторныйПересчет=Истина;
	
	ДопПараметры = Новый Структура;
 	ДопПараметры.Вставить("НеКонтролироватьЗамены",Истина);
	//ДопПараметры.Вставить("НеПерерасчитыватьЦену",Ложь);
 	
	Для Каждого СтрокаТовары Из РеализацияОбъект.Товары Цикл
		
		СуммаСписания = дкПолучитьСуммуСписания(РеализацияОбъект, "ПартииТоваровКомпании", , СтрокаТовары.Номенклатура,, СтрокаТовары.НомерСтроки);
 		
		РеализацияОбъект.ОбработкаРеквизита("Товары.Номенклатура", СтрокаТовары,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.Количество", СтрокаТовары,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения", СтрокаТовары,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Организация", СтрокаТовары,, ДопПараметры);
		РеализацияОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", СтрокаТовары,, ДопПараметры);
		СтрокаТовары.СуммаВсего = СуммаСписания;
 		РеализацияОбъект.ОбработкаРеквизита("Товары.СуммаВсего", СтрокаТовары,, ДопПараметры);
		
		Если СтрокаТовары.КоличествоБазовое > 0 Тогда
			СтрокаТовары.Цена = СуммаСписания/СтрокаТовары.КоличествоБазовое;	
 		КонецЕсли; 
  
	КонецЦикла;
	
 	Если БылПовторныйПересчет Тогда
		Попытка
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			#Если НаКлиенте Тогда
				СМГ_Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЕстьОшибки=Истина;
		КонецПопытки;
	КонецЕсли; 
 	
	Если ЕстьОшибки Тогда
		#Если НаКлиенте Тогда
			СМГ_Сообщить("ОШИБКА! Реализация для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		#КонецЕсли 
 	КонецЕсли; 
	
 	Попытка
		СвойствоАвто = РегиСтрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		СвойствоАвто.Объект   = РеализацияОбъект.Ссылка;
		СвойствоАвто.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДокументСозданАвтоматически;
		СвойствоАвто.Значение = Истина;
		СвойствоАвто.Записать(Истина);
	Исключение
		//
	Конецпопытки;	
 	
	СМГ_Сообщить("Сформирован новый документ: "+РеализацияОбъект,СтатусСообщения.Информация);
	
	ТабДок  = Новый ТабличныйДокумент;
 	РеализацияОбъект.ПечатьУПД(ТабДок);
 	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр=Истина;
	//ТабДок.Показать();
	
	ФормироватьСФ = Истина;
 	
	Если ФормироватьСФ Тогда
		
		СчетФактураОбъект = Документы.СчетФактураВыданный.СоздатьДокумент();
		СчетФактураОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
		
		ЕстьОшибки=Ложь;
		
		Попытка
			СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Попытка
				СчетФактураОбъект.УстановитьНовыйНомер();
				СчетФактураОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				СМГ_Сообщить(ОписаниеОшибки());
				ЕстьОшибки=Истина;
			КонецПопытки;	
		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			СМГ_Сообщить("ОШИБКА! СчетФактура выданный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		Иначе
			СМГ_Сообщить("Сформирован документ: "+СчетФактураОбъект,СтатусСообщения.Информация);		
 		КонецЕсли; 
 		
		//ТабДок = Новый ТабличныйДокумент;
		//
		//СчетФактураОбъект.ПечатьСчетФактура(ТабДок);
		//ТабДок.АвтоМасштаб=Истина;
		//ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		//ТабДок.ТолькоПросмотр=Истина;
		//ТабДок.Показать();
		
	КонецЕсли; 
		
	ПоступлениеОбъект = Документы.ПоступлениеТоваров.СоздатьДокумент();
	//ПоступлениеОбъект.ОбработкаЗаполнения(РеализацияОбъект.Ссылка);
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.РегламентированныйУчет = Истина;
	ПоступлениеОбъект.Дата = ТекущаяДата();
	ПоступлениеОбъект.УстановитьНовыйНомер();
	ПоступлениеОбъект.ХозОперация = Справочники.ХозОперации.ПоступлениеТоваров;
	ПоступлениеОбъект.ДокументОснование = РеализацияОбъект.Ссылка;
	
	ПоступлениеОбъект.Организация = СкладПолучатель.Организация;
	ПоступлениеОбъект.ОбработкаРеквизита("Организация");
	
	ПоступлениеОбъект.ВхДокДата = РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	ПоступлениеОбъект.ПодразделениеКомпании = СкладПолучатель.Подразделение;
	ПоступлениеОбъект.ОбработкаРеквизита("ПодразделениеКомпании");
	
	ПоступлениеОбъект.СкладКомпании = СкладПолучатель;
	ПоступлениеОбъект.ОбработкаРеквизита("СкладКомпании");
	
	ПоступлениеОбъект.ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ПоступлениеОбъект.ОбработкаРеквизита("ТипЦен");
	
	ПоступлениеОбъект.КурсДокумента = 1;
	ПоступлениеОбъект.КурсВалютыВзаиморасчетов = 1;
	ПоступлениеОбъект.КурсВалютыУпр = 1;
	
	ПоступлениеОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ПоступлениеОбъект.ОбработкаРеквизита("ВалютаДокумента");
	
	ПоступлениеОбъект.Контрагент = РеализацияОбъект.Организация.КонтрагентОрганизации;
	//Бондаренко++ 20210415
	//Если ПоступлениеОбъект.Контрагент.Родитель = Справочники.Контрагенты.ДопОборудование Тогда
	//	ПоступлениеОбъект.Контрагент = Справочники.Контрагенты.ОсновнойПоставщик;	
	//КонецЕсли; 
	//Бондаренко-- 20210415
 	ПоступлениеОбъект.ОбработкаРеквизита("Контрагент");
	
	ПараметрыДоговора = Новый Структура;
	ПараметрыДоговора.Вставить("Контрагент",ПоступлениеОбъект.Контрагент);
	ПараметрыДоговора.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.Покупка);
	ПараметрыДоговора.Вставить("Организация",ПоступлениеОбъект.Организация);
	ПараметрыДоговора.Вставить("Подразделение",ПоступлениеОбъект.ПодразделениеКомпании);
	
	ПоступлениеОбъект.ДоговорВзаиморасчетов = НайтиДоговорОбщийМодуль(ПараметрыДоговора);
	ПоступлениеОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");
	
	ПоступлениеОбъект.ПроводитьПриНаличииОшибок = Истина;
	
	ПоступлениеОбъект.ВхДокДата  =РеализацияОбъект.Дата;
	ПоступлениеОбъект.ВхДокНомер = РеализацияОбъект.Номер;
	
	ПоступлениеОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПоступлениеОбъект.Комментарий = "Создан: "+ТекущаяДата()+" пользователем: "+ПараметрыСеанса.Пользователь+" для перепродажи запасных частей между организациями.";
	
	ВремТЗ=РеализацияОбъект.Товары.Выгрузить();
	
	//Бондаренко++ 20210809
	ЗаполнитьБазовоеКоличество = Ложь;
 	Если НЕ обЗначениеНеЗаполнено(СчетФактураОбъект) Тогда
 		ВремТЗ=СчетФактураОбъект.Товары.Выгрузить();
		ЗаполнитьБазовоеКоличество = Истина;
   	КонецЕсли; 
	//Бондаренко-- 20210809
 
	ПоступлениеОбъект.Товары.Загрузить(ВремТЗ);
	
	//Бондаренко++ 20210809
 	Если ЗаполнитьБазовоеКоличество Тогда
		Для каждого Стр Из ПоступлениеОбъект.Товары Цикл
 			Стр.КоличествоБазовое = Стр.Количество * Стр.Коэффициент;
  		КонецЦикла; 
	КонецЕсли; 
	//Бондаренко-- 20210809
 	
	//Бондаренко++ 20201214
	//Если ТабКодов.Количество() > 0 Тогда
	//	ПоступлениеОбъект.КодыМаркировки.Загрузить(ТабКодов);			
	//КонецЕсли; 
	//Бондаренко-- 20201214
	
	ЕстьОшибки=Ложь;
	
	Попытка
		ПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СМГ_Сообщить(ОписаниеОшибки());
		ЕстьОшибки=Истина;
	КонецПопытки;
	
	Если ЕстьОшибки Тогда
		СМГ_Сообщить("ОШИБКА! Поступление товаров для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
	Иначе
		СМГ_Сообщить("Сформирован новый документ: "+ПоступлениеОбъект,СтатусСообщения.Информация);
 	КонецЕсли; 
  	
	Если ФормироватьСФ Тогда
		
		СчетФактураПолученныйОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		СчетФактураПолученныйОбъект.ОбработкаЗаполнения(ПоступлениеОбъект.Ссылка);
		
		ЕстьОшибки=Ложь;
		Попытка
			СчетФактураПолученныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			СМГ_Сообщить(ОписаниеОшибки());
			ЕстьОшибки=Истина;
		КонецПопытки;	
		
		Если ЕстьОшибки Тогда
			СМГ_Сообщить("ОШИБКА! СчетФактура полученный для перепродажи не сформирована.",СтатусСообщения.ОченьВажное);
		Иначе	
			СМГ_Сообщить("Сформирован документ: "+СчетФактураПолученныйОбъект,СтатусСообщения.Информация);	
 		КонецЕсли; 
 		
	КонецЕсли;
	
	Возврат РеализацияОбъект;
	
КонецФункции

Функция ПереместитьЗапасныеЧастиСПерепродажамиПриНеобходимости(ДокументИсточник) Экспорт
	
	Рез=Истина;
	
	СкладПолучатель = Справочники.СкладыКомпании.ПустаяСсылка();
	
	Попытка
		ТаблицаТоваровСИсточниками = ДокументИсточник.Товары.Выгрузить();
	Исключение
 		СМГ_Сообщить("ОШИБКА! Не удалось выгрузить табличную часть товары из документа "+ДокументИсточник);
		Рез=Ложь;
		Возврат Рез;		
 	КонецПопытки; 
 	
	Если ТипЗНЧ(ДокументИсточник) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
 		СкладПолучатель = ДокументИсточник.Цех.СкладКомпании;
	Иначе 
		СкладПолучатель = ДокументИсточник.СкладКомпании;
 	КонецЕсли; 
	
	СписокСкладов = Новый СписокЗначений;
	НовТаб = ТаблицаТоваровСИсточниками.Скопировать();
 	НовТаб.Свернуть("СкладКомпании");
	СписокСкладов.ЗагрузитьЗначения(НовТаб.ВыгрузитьКолонку("СкладКомпании"));
	
	Для Каждого СкладОтправитель из СписокСкладов Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("СкладКомпании",СкладОтправитель.Значение);
		ТаблицаТоваров = ТаблицаТоваровСИсточниками.Скопировать(Отбор);
		Если ТаблицаТоваров.Количество() > 0 Тогда
		    СоздатьДокументы(ТаблицаТоваров,ДокументИсточник,СкладОтправитель.Значение,СкладПолучатель);
 		КонецЕсли; 
	КонецЦикла;
  	
	Возврат Рез; 
	
КонецФункции // ПереместитьЗапасныеЧастиСПерепродажамиПриНеобходимости(ДокументИсточник)

Процедура СоздатьДокументы(ТаблицаТоваров,СсылкаНаДокументИнициатор,СкладОтправитель,СкладПолучатель) Экспорт
	
  	НачатьТранзакцию();
	
	СкладИсточникПеремещения = СкладОтправитель;
	
	Если СкладОтправитель.Организация <> СкладПолучатель.Организация Тогда
		СкладИсточникПеремещения = НайтиСоответствующийСкладОрганизации(СкладПолучатель.Организация,СкладОтправитель);
	 	ДокОбъектРеализация = СоздатьДокументыПерепродажиПоЮрЛицамОбщийМодуль(ТаблицаТоваров,СсылкаНаДокументИнициатор, СкладОтправитель, СкладИсточникПеремещения);
	КонецЕсли;	
	
	Если СкладИсточникПеремещения.Подразделение.Родитель <> СкладПолучатель.Подразделение.Родитель Или СкладИсточникПеремещения <> СкладПолучатель Тогда
		ДокОбъектПеремещение = СоздатьМежскладскоеПеремещениеОбщийМодуль(ТаблицаТоваров,СсылкаНаДокументИнициатор,СкладИсточникПеремещения,СкладПолучатель);
		Если Не обЗначениеНеЗаполнено(ДокОбъектПеремещение) Тогда
			Если Не обЗначениеНеЗаполнено(ДокОбъектРеализация) Тогда
				ДокОбъектПеремещение.ДокументОснование = ДокОбъектРеализация.Ссылка;
				Попытка
					ДокОбъектПеремещение.Записать(РежимЗаписиДокумента.Запись);
					СМГ_Сообщить("Записан документ: "+ДокОбъектПеремещение+" с документом-основанием: "+ДокОбъектПеремещение.ДокументОснование,СтатусСообщения.ОченьВажное);		
				Исключение
					СМГ_Сообщить("ОШИБКА!! Не удалось записать документ: "+ДокОбъектПеремещение,СтатусСообщения.ОченьВажное);		
				КонецПопытки; 
			КонецЕсли; 		
		КонецЕсли; 			
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
  	
КонецПроцедуры

Функция НайтиСоответствующийСкладОрганизации(Организация,Склад) Экспорт
	
	//Найти подразделение нужной организации в родительском подразделении
	
	НайденноеПодразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка,
	|	ПодразделенияКомпании.Родитель,
	|	ПодразделенияКомпании.Организация
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Родитель = &Родитель
	|	И ПодразделенияКомпании.Организация = &Организация
	|	И ПодразделенияКомпании.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Родитель", Склад.Подразделение.Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденноеПодразделение=ВыборкаДетальныеЗаписи.Ссылка; 
		Прервать;
	КонецЦикла;
	
	
	//Найти склад нужного типа в найденном подразделении
	
	НайденныйСклад = Справочники.СкладыКомпании.ПустаяСсылка();
	
	Если Не обЗначениеНеЗаполнено(НайденноеПодразделение) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыКомпании.Ссылка,
		|	СкладыКомпании.ЭтоГруппа,
		|	СкладыКомпании.ПометкаУдаления,
		|	СкладыКомпании.Подразделение,
		|	СкладыКомпании.ВидСклада,
		|	СкладыКомпании.ТипСклада,
		|	СкладыКомпании.Основной КАК Основной
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|ГДЕ
		|	СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.Подразделение = &НайденноеПодразделение
		|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|	И СкладыКомпании.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Обычный)
		|	И СкладыКомпании.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ЗапЧасти)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основной УБЫВ";
		
		Запрос.УстановитьПараметр("НайденноеПодразделение", НайденноеПодразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НайденныйСклад = ВыборкаДетальныеЗаписи.Ссылка;
			Прервать;
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат  НайденныйСклад;
	
КонецФункции
 
Процедура ТоварыСкладКомпанииНачалоВыбораИзСпискаОбщийМодуль(Элемент, СтандартнаяОбработка, Организация, ТекСтрока) Экспорт
	
 	ТекНоменклатура = ТекСтрока.Номенклатура;
	ТекСклад = ТекСтрока.СкладКомпании;
	
	Если обЗначениеНеЗаполнено(ТекНоменклатура) Тогда
		Возврат;
	КонецЕсли; 
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК РезервОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
		|ГДЕ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура = &Номенклатура
		//Бондаренко++ 20210311
		|	И (ОстаткиТоваровКомпанииОстатки.СкладКомпании.Организация.КонтрагентОрганизации В ИЕРАРХИИ (&НашиФирмы)
		|			ИЛИ ОстаткиТоваровКомпанииОстатки.СкладКомпании.Организация = &ТекущаяОрганизация)
		//Бондаренко-- 20210311
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании";
	
	Запрос.УстановитьПараметр("Номенклатура", ТекНоменклатура);
	//Бондаренко++ 20210311
	Запрос.УстановитьПараметр("НашиФирмы", Справочники.Контрагенты.НашиФирмы);
	Запрос.УстановитьПараметр("ТекущаяОрганизация",Организация);	
	//Бондаренко-- 20210311
 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	НайдСтр = Новый Массив;
	
	Если Не обЗначениеНеЗаполнено(ТекСклад) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СкладКомпании",ТекСклад);
		НайдСтр = ТЗ.НайтиСтроки(Отбор);
	КонецЕсли; 
	
	Если НайдСтр.Количество() = 0 Тогда
		Рез = ТЗ.ВыбратьСтроку("Выберите склад остатков для ["+ТекНоменклатура.Артикул+"] "+ТекНоменклатура);
 	Иначе
		Рез = ТЗ.ВыбратьСтроку("Выберите склад остатков для ["+ТекНоменклатура.Артикул+"] "+ТекНоменклатура,НайдСтр[0]);
	КонецЕсли; 
 	
	Если Рез <> Неопределено Тогда
		ТекСтрока.СкладКомпании = Рез.СкладКомпании;	
	Иначе
		ТекСтрока.СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
 	КонецЕсли; 
  	
КонецПроцедуры
  
Функция ПерепродажаРазрешена(ДокСсылка) Экспорт
	ТЗ = Новый ТаблицаЗначений;
	ТЗ = ДокСсылка.Товары.Выгрузить().Скопировать();
	ТЗ.Свернуть("СкладКомпании");
	ТекКонтр=ДокСсылка.Контрагент;
  	ФлагПерепродажаРазрешена = Истина;
	Для каждого Стр Из ТЗ Цикл
		Если (Стр.СкладКомпании.Организация.КонтрагентОрганизации.Родитель = Справочники.Контрагенты.НашиФирмы И ТекКонтр.Родитель=Справочники.Контрагенты.ДопОборудование) ИЛИ 
			 (Стр.СкладКомпании.Организация.КонтрагентОрганизации.Родитель = Справочники.Контрагенты.ДопОборудование И ТекКонтр.Родитель=Справочники.Контрагенты.НашиФирмы) Тогда
 				#Если НаКлиенте Тогда
				СМГ_Сообщить("Перепродажа со склада '"+Стр.СкладКомпании+"' контрагенту '"+ТекКонтр+"' запрещена.",СтатусСообщения.ОченьВажное);	 
 				#КонецЕсли
 				ФлагПерепродажаРазрешена = Ложь;				 
  		КонецЕсли; 
	КонецЦикла; 
 	Возврат ФлагПерепродажаРазрешена;
КонецФункции // ПерепродажаРазрешена(ТабличнаяЧастьТовары)
//Бондаренко-- 20220318 

//Галактионов ++ 07.02.2024 ЧестныйЗнак
Функция ГВС_УниверсальнаяПерепродажаПоВсемСкладам(Ссылка_Товары,Ссылка_КодыМаркировки,Ссылка,ТекСкладКомпании) Экспорт 

 	Отказ = Ложь;
	
	СписокСкладов = Новый СписокЗначений;
	
	Для каждого Стр Из Ссылка_Товары Цикл 
		Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваров") Тогда 
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(Стр.СкладКомпании) Тогда
			    Продолжить;
			КонецЕсли;
			Если Стр.СкладКомпании.Организация = ТекСкладКомпании.Организация Тогда
				Если ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.ПеремещениеТоваровВПроизводство") И ТипЗНЧ(Ссылка)<>Тип("ДокументСсылка.РеализацияТоваров") Тогда
					Продолжить;			
 				КонецЕсли;
			КонецЕсли;
			Если Стр.СкладКомпании = ТекСкладКомпании Тогда
				Продолжить;			
 			КонецЕсли;
            //Бондаренко-- 20220120
  			Если СписокСкладов.НайтиПоЗначению(Стр.СкладКомпании) = Неопределено Тогда
				СписокСкладов.Добавить(Стр.СкладКомпании);					
			КонецЕсли;
		Иначе 
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(Стр.СкладыКомпании) Тогда
			    Продолжить;
			КонецЕсли;
			Если Стр.СкладыКомпании.Организация = ТекСкладКомпании.Организация Тогда
				Продолжить;			
 			КонецЕсли;
            //Бондаренко-- 20220120
 			Если СписокСкладов.НайтиПоЗначению(Стр.СкладыКомпании) = Неопределено Тогда
				СписокСкладов.Добавить(Стр.СкладыКомпании);					
			КонецЕсли;
		КонецЕсли;
 	КонецЦикла;
	
	//Бондаренко++ 20220120
	Если СписокСкладов.Количество() > 0 Тогда
	//Бондаренко-- 20220120	
 		Для каждого СкладОтправитель Из СписокСкладов Цикл
			//Бондаренко++ 20220120
			Если обЗначениеНеЗаполнено(СкладОтправитель.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если СкладОтправитель.Значение.Организация = ТекСкладКомпании.Организация Тогда
				//Бондаренко++ 20220120
				Если СкладОтправитель.Значение <> ТекСкладКомпании Тогда
					Если ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваровВПроизводство") ИЛИ ТипЗНЧ(Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
						Отказ = СоздатьМежскладскоеПеремещение(Ссылка_Товары,Ссылка,СкладОтправитель.Значение,ТекСкладКомпании);
					КонецЕсли;	
 				КонецЕсли;
 				//Бондаренко++ 20220120
				Продолжить;			
			КонецЕсли;
			//Бондаренко-- 20220120
			Отказ = УниверсальнаяПерепродажа(Ссылка_Товары,Ссылка_КодыМаркировки,Ссылка,ТекСкладКомпании,СкладОтправитель.Значение);
			Если Отказ Тогда
				СМГ_Сообщить("Ошибка! Документы перепродажи не сформированы.",СтатусСообщения.ОченьВажное);
				СМГ_Сообщить("_____________________________________________",СтатусСообщения.ОченьВажное);	
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Отказ Тогда
			СМГ_Сообщить("Обработка по перепродаже завершена без ошибок.",СтатусСообщения.Обычное);	
			СМГ_Сообщить("=============================================",СтатусСообщения.Обычное);
			Возврат Истина;
		КонецЕсли;
	//Бондаренко++ 20220120	
	Иначе
		СМГ_Сообщить("Список складов пустой. Нечего перепродавать.",СтатусСообщения.Обычное);
		Возврат Ложь;
  	КонецЕсли;                 	
    //Бондаренко-- 20220120
	
	//Возврат Отказ;
	
КонецФункции
//Галактионов -- 07.02.2024 ЧестныйЗнак
